Конфигурация отчетов/DataProcessors/ПроверкаОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаОборудования</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/Enums/ВидыОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свитч</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Монитор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роутер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемныйБлок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СенсорныйМонитор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Терминал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бесперебойник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принтер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Catalogs/Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Оборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местонахождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Локации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваВладения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидИнформацииОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.НашеПО</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УчетныеЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУчетнойЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУчетныхЗаписей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/ПроверкаОборудования/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПроверитьНаСервере()
	Результат = ВнешнееВзаимодействие.Пинг(Адрес);
	Статус = Результат.Успех;
	Если Статус = Истина Тогда
		Статус = "АКТИВЕН";
	Иначе
		Статус = "НЕ ДОСТУПЕН";
	КонецЕсли;
	
	КоличествоУдачныхПопыток = Результат.КоличествоУдачныхПопыток;
	ТексСообщения = "Адресс "+Адрес+" имеет статус - "+Строка(Статус)+" || количество удачных попыток - "+Строка(КоличествоУдачныхПопыток)+"/4";
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТексСообщения;
	Сообщение.Сообщить();
КонецПроцедуры


&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьВсеОборудованиеНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОборудованиеДополнительнаяИнформация.ВидИнформации КАК ВидИнформации,
		|	ОборудованиеДополнительнаяИнформация.Данные КАК Данные,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.Местонахождения КАК Местонахождения,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.Локация КАК Локация,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.ВидОборудования КАК ВидОборудования,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.Код КАК Код,
		|	ОборудованиеДополнительнаяИнформация.Ссылка.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Оборудование.ДополнительнаяИнформация КАК ОборудованиеДополнительнаяИнформация
		|ГДЕ
		|	ОборудованиеДополнительнаяИнформация.ВидИнформации = &ВидИнформации
		|	И ОборудованиеДополнительнаяИнформация.Ссылка.ВидОборудования = &ВидОборудования";
	
	Запрос.УстановитьПараметр("ВидОборудования", Перечисления.ВидыОборудования.Принтер);
	Запрос.УстановитьПараметр("ВидИнформации", Справочники.ВидИнформацииОборудования.IP_адрес);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = ВнешнееВзаимодействие.Пинг(Выборка.Данные);
		Статус = Результат.Успех;
		КоличествоУдачныхПопыток = Результат.КоличествоУдачныхПопыток;

		Если Статус = Истина Тогда
			Статус = "АКТИВЕН";
		Иначе
			Статус = "НЕ ДОСТУПЕН";
		КонецЕсли;

		Сообщить("Проверка принтера: " + Выборка.Местонахождения + " (" + Выборка.Локация+ ")" + Символы.ПС
				+ "Адресс: " + Выборка.Данные + Символы.ПС
				+ "Состояние: " + Статус + Символы.ПС
				+ "Количество удачных попыток: " + Строка(КоличествоУдачныхПопыток) + "/4");
				
		ВнешнееВзаимодействие.ЗаписьАктивностьОбрудования_В_Регистр(Выборка.Ссылка, Результат.Успех, КоличествоУдачныхПопыток); 		
	КонецЦикла;
	 	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВсеОборудование(Команда)
	ПроверитьВсеОборудованиеНаСервере();
КонецПроцедуры
